# 1.Реализовать скрипт, в котором должна быть предусмотрена функция
# расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу:
# (выработка в часах*ставка в час) + премия.
# Для выполнения расчета для конкретных значений
# необходимо запускать скрипт с параметрами.


def _calc():
    _a = float(input('Количество отработанных часов: '))
    _b = float(input('Ставка в час: '))
    _c = float(input('Размер премии: '))

    p = _a * _b
    return p + _c


print(f'Размер заработной платы: {_calc()}')

# 2. Представлен список чисел.
# Необходимо вывести элементы исходного списка,
# значения которых больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка.
# Для формирования списка использовать генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].

a = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
b = [num1 for num1, num2 in zip(a[1:], a[:-1]) if num1 > num2]
print(b)

# 3. Для чисел в пределах от 20 до 240 найти числа, кратные 20 или 21.
# Необходимо решить задание в одну строку.
# Подсказка: использовать функцию range() и генератор.
print([el for el in range(20, 240) if el % 20 == 0 or el % 21 == 0])

# 4. Представлен список чисел.
# Опрделить элементы списка, не имеющие повторений.
# Сформировать итоговый массив чисел, соответствующих требованию.
# Элементы вывести в порядке их следования в исходном списке.
# Для выполнения задания обязательно использовать генератор.
# Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
# Результат: [23, 1, 3, 10, 4, 11]

array1 = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]
array2 = [el for el in array1 if array1.count(el) == 1]
print(array2)

# 5. Реализовать формирование списка,
# используя функцию range() и возможности генератора.
# В список должны войти четные числа от 100 до 1000 (включая границы).
# Необходимо получить результат вычисления произведения всех элементов списка.
# Подсказка: использовать функцию reduce().


from functools import reduce


def _func(el_p, el):
    return el_p * el


print(f'Список четных чисел {[el for el in range(99, 1001) if el % 2 == 0]}')

print(f'Результат чисел:  {reduce(_func, [el for el in range(99, 1001) if el % 2 == 0])}')


# 6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
#
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным.
# Необходимо предусмотреть условие его завершения.
#
# Например, в первом задании выводим целые числа, начиная с 3,
# а при достижении числа 10 завершаем цикл. Во втором также необходимо предусмотреть условие,
# при котором повторение элементов списка будет прекращено.

def gen1():
    a_1 = int(input('Введите стартовое число: '))
    from itertools import islice
    from itertools import count

    for i in islice(count(a_1), 10):  # генерирует 10 чисел начиная с указанного
        print(i)


gen1()


def gen2():
    _list = [1, 5, None, 78, 88, 'YUY']

    from itertools import islice
    from itertools import cycle

    for el in islice(cycle(_list), 10):
        print(el)


gen2()
